using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace 魔王的试炼
{
    /// <summary>
    /// 游戏地图元素类型枚举
    /// </summary>
    enum MotaElement
    {
        //空地
        Empty = 0,

        选中怪物背景 = 2,
        指引指针 = 3,

        //箱子
        箱子 = 5,
        目标 = 6,

        //箭头
        向下箭头 = 10,
        向上箭头 = 11,
        向左箭头 = 12,
        向右箭头 = 13,
        商店左 = 14,
        商店右 = 15,

        //墙
        墙1 = 20,
        墙2 = 21,
        墙3 = 22,
        墙4 = 23,
        墙5 = 24,
        墙6 = 25,
        墙7 = 26,
        熔岩 = 27,
        星星 = 28,

        //暗墙
        暗墙1 = 30,
        暗墙2 = 31,
        暗墙3 = 32,

        //路障
        路障 = 35,
        
        //其他
        小黄钥匙 = 40,
        小蓝钥匙 = 41,
        小红钥匙 = 42,

        //楼梯
        下楼 = 50,
        上楼 = 51,

        //门
        黄门 = 60,
        蓝门 = 61,
        红门 = 62,
        花门 = 63,
        铁门 = 64,

        //人物
        勇士 = 80,

        //npc
        商人 = 90,
        老人 = 91,
        商店 = 92,
        仙子 = 93,
        公主 = 94,
        
        //血瓶
        红血瓶 = 110,
        蓝血瓶 = 111,
        圣水瓶 = 112,

        //宝石
        蓝宝石 = 120,
        红宝石 = 121,

        //道具
        大金币 = 130,
        小飞羽 = 131,
        怪物手册 = 132,
        楼层传送器 = 133,
        破墙镐 = 134,
        十字架 = 135,
        自然之靴 = 136,
        上楼器 = 137,
        道具包 = 138,
        怪物探测器 = 139,

        //钥匙
        黄钥匙 = 150,
        蓝钥匙 = 151,
        红钥匙 = 152,
        钥匙盒 = 155,

        //装备
        铁剑 = 160,
        铁盾 = 161,
        青峰剑 = 162,
        黄金盾 = 163,
        神圣剑 = 164,
        神圣盾 = 165,



        //怪物
        //青色史莱姆 = 200,
        //红色史莱姆 = 201,
        //黑色史莱姆 = 202,
        //大史莱姆 = 203,
        //小蝙蝠 = 204,
        //大蝙蝠 = 205,
        //红蝙蝠 = 206,
        //初级警卫 = 214,
    }

}





