/*-----------------------------------------------
名称：数码管动态显示
公司：南京爱思电子
编写：rantg
日期：2012.3
内容：数码管动态显示0-3
	  在使用数码管显示时把P16 数码管/液晶显示复用
	  端用跳帽连起来，使用液晶显示时拔掉跳帽
------------------------------------------------*/

#include<reg52.h> 

unsigned char code DuanMa[]={0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f};// 显示段码值01234567
unsigned char code WeiMa[]={0xf7,0xef,0xdf,0xbf};//分别对应相应的数码管点亮,即位码

void Delay(unsigned int t); //函数声明

/*------------------------------------------------
                    主函数
------------------------------------------------*/
void main(void)
{
	unsigned char i=0;
	while(1)
	{
		P1=WeiMa[i]; //取位码 			
		P0=DuanMa[i]; //取显示数据，段码				
		Delay(600); // 扫描间隙延时，时间太长会闪烁，太短会造成重影，
		//这里故意延长时间，方便直观看出动态扫描原理
		i++;
		if(4==i)    //检测8位扫描完全结束？如扫描完成则从第一个
		//开始再次扫描8位
		i=0;
	}
}

/*------------------------------------------------
 延时函数
------------------------------------------------*/
void Delay(unsigned int t)
{
	while(--t);
}

