/*------------------------------------------------
名称：独立按键
公司：南京爱思电子
编写：rantg
日期：2012.3
内容：检测K1，K2，K3，K4四个独立按键，并在数码管上
	  显示相应的键值，使用	  独立按键时，开发板上
	  P21复用端通过跳帽接到独立按键
------------------------------------------------*/

#include <reg52.h> 

/*------------------------------------------------
                    定义按键
------------------------------------------------*/
sbit k1 = P3^0; 
sbit k2 = P3^1;
sbit k3 = P3^2;
sbit k4 = P3^3;

unsigned char code DuanMa[5]={0x3f,0x06,0x5b,0x4f,0x66};// 显示段码值0~4

/*------------------------------------------------				   
                   函数声明
------------------------------------------------*/
void DelayMs(unsigned char t); //ms级延时
unsigned char KeyScan(void);//键盘扫描

/*------------------------------------------------
                    主函数
------------------------------------------------*/
void main (void)
{              
	P1 = 0xf7;
	P0 = DuanMa[0];
	
	while (1)      
	{	
		if(0 == k1)
		{
			DelayMs(10);      		//按键消抖
			if(0 == k1)
			{
				P0 = DuanMa[1];
				DelayMs(600);
			}
			while(!k1);			   //等待按键释放
		}
		
		if(0 == k2)
		{
			DelayMs(10);
			if(0 == k2)
			{
				P0 = DuanMa[2];
				DelayMs(600);
			}
			while(!k2);
		}
		
		if(0 == k3)
		{
			DelayMs(10);
			if(0 == k3)
			{
				P0 = DuanMa[3];
				DelayMs(600);
			}
			while(!k3);
		}	

		if(0 == k4)
		{
			DelayMs(10);
			if(0 == k4)
			{
				P0 = DuanMa[4];
				DelayMs(600);
			}
			while(!k4);
		}
	}
}

/*------------------------------------------------
 mS延时函数
------------------------------------------------*/
void DelayMs(unsigned char t)
{
	unsigned char i;
	for(; t > 0; t--)  //延时约t ms
		for(i = 110; i > 0; i--);
}
